testCases/testPyro3/constant/polyMesh/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.1.x                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

convertToMeters 1;

vertices
(
    (-0.06  0.0 -0.001)
    ( 0.06  0.0 -0.001)
    ( 0.06  0.2 -0.001)
    (-0.06  0.2 -0.001)
    (-0.06  0.0  0.001)
    ( 0.06  0.0  0.001)
    ( 0.06  0.2  0.001)
    (-0.06  0.2  0.001)
);

blocks
(
    hex (0 1 2 3 4 5 6 7) (90 150 1) simpleGrading (1 1 1)
);

edges
(
);

boundary
(
    bottom
    {
        type patch;
        faces
        (
            (0 1 5 4)
        );
    }
    sides
    {
        type patch;
        faces
        (
            (0 4 7 3)
            (1 2 6 5)
        );
    }
    frontAndBack
    {
        type symmetryPlane;
        faces
        (
            (4 5 6 7)
            (1 0 3 2)
        );
    }
    top
    {
        type patch;
        faces
        (
            (7 6 2 3)
        );
    }
);

mergePatchPairs
(
);

// ************************************************************************* //
