testCases/testPyro3/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.1.x                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      binary;
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

4
(
    bottom
    {
        type            patch;
        nFaces          90;
        startFace       26760;
    }
    sides
    {
        type            patch;
        nFaces          300;
        startFace       26850;
    }
    frontAndBack
    {
        type            symmetryPlane;
        nFaces          27000;
        startFace       27150;
    }
    top
    {
        type            patch;
        nFaces          90;
        startFace       54150;
    }
)

// ************************************************************************* //
